In [1]:
import pandas as pd
import datetime as dt # part of python language

## Review of Python's `datetime` Module

In [2]:
someday = dt.date(2006, 6, 24)

In [3]:
someday.year
someday.month
someday.day

24

In [4]:
str(someday)

'2010-01-20'

In [4]:
str(dt.datetime(2010, 1, 10, 17, 13, 57))

'2010-01-10 17:13:57'

In [5]:
sometime = dt.datetime(2010, 1, 10, 17, 13, 57)

In [6]:
sometime.year
sometime.month
sometime.day
sometime.hour
sometime.minute
sometime.second

57

## The `pandas Timestamp` Object
Pandas version of datetime

In [7]:
pd.Timestamp("2015-03-31")
pd.Timestamp("2015/03/31")
pd.Timestamp("2013, 11, 04")
pd.Timestamp("1/1/2015")
pd.Timestamp("19/12/2015")
pd.Timestamp("12/19/2015")
pd.Timestamp("4/3/2000")
pd.Timestamp("2021-03-08 08:35:15")
pd.Timestamp("2021-03-08 6:13:29 PM")

C:\Users\Gebruiker\anaconda3\envs\pandas_playground\lib\site-packages\IPython\core\interactiveshell.py:3106: UserWarning: Parsing '19/12/2015' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

Timestamp('2021-03-08 18:13:29')

In [8]:
pd.Timestamp(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [9]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))

Timestamp('2000-02-03 21:35:22')

## The `pandas DateTimeIndex` Object
A collection of pandas timestamp

In [10]:
dates = ["2016/01/02", "2016/04/12", "2009/09/07"]
pd.DatetimeIndex(dates) #constructor method

DatetimeIndex(['2016-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [11]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 29)]
dtIndex = pd.DatetimeIndex(dates)

In [12]:
values = [100, 200, 300]
pd.Series(data = values, index = dtIndex)

2016-01-10    100
1994-06-13    200
2003-12-29    300
dtype: int64

## The `pd.to_datetime()` Method
Method to convert an existing object into a pandas time related object

In [13]:
pd.to_datetime("2001-04-19")
pd.to_datetime(dt.date(2015, 1, 1))
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"]) # most common use to convert existing pandas series to timestamp object

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [14]:
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])
times

0        2015-01-03
1        2014/02/08
2              2016
3    July 4th, 1996
dtype: object

In [15]:
pd.to_datetime(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [16]:
dates = pd.Series(["July 4th, 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [18]:
pd.to_datetime(dates, errors = "coerce")# look at doc to help understand coerce application

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [19]:
pd.to_datetime([1349720105, 1349806505, 1349892905, 1349979305, 1350065705], unit = "s") # unixs times

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

In [20]:
pd.Period("2016-01-08", freq = "10D")

Period('2016-01-08', '10D')

In [21]:
dates = ["2016-01-01", "2016-02-01", "2016-03-01"]
pd.Series([1, 2, 3], index = pd.PeriodIndex(dates, freq = "2M"))

2016-01    1
2016-02    2
2016-03    3
Freq: 2M, dtype: int64

In [22]:
pd.Period("2016-01-08", freq = "W")
pd.Period("2016-01-08", freq = "W-SUN")
pd.Period("2016-01-08", freq = "W-WED")
pd.Period("2015-12-10", freq = "10D")

dates = ["2016-01-01", "2016-02-01", "2016-02-01"]
pd.PeriodIndex(dates, freq = "W-MON")
weeks = pd.PeriodIndex(dates, freq = "W-MON")

pd.Series([999, 500, 325], index = weeks, name = "Weekly Revenue")

2015-12-29/2016-01-04    999
2016-01-26/2016-02-01    500
2016-01-26/2016-02-01    325
Freq: W-MON, Name: Weekly Revenue, dtype: int64

## Create Range of Dates with the `pd.date_range()` Method, Part 1

In [23]:
times = pd.date_range(start = "2016-01-01", end = "2016-01-10", freq = "D") # two out of the parameters of must be used

In [24]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [25]:
type(times[0])

pandas._libs.tslibs.timestamps.Timestamp

In [26]:
pd.date_range(start = "2016-01-01", end = "2050-01-01", freq = "A") # freq argument accepts multiple arguments

DatetimeIndex(['2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31', '2037-12-31', '2038-12-31', '2039-12-31',
               '2040-12-31', '2041-12-31', '2042-12-31', '2043-12-31',
               '2044-12-31', '2045-12-31', '2046-12-31', '2047-12-31',
               '2048-12-31', '2049-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

## Create Range of Dates with the `pd.date_range()` Method, Part 2

In [27]:
pd.date_range(start = "2012-09-09", periods = 50, freq = "6H") # Generates 50 timestamps at 6h apart

DatetimeIndex(['2012-09-09 00:00:00', '2012-09-09 06:00:00',
               '2012-09-09 12:00:00', '2012-09-09 18:00:00',
               '2012-09-10 00:00:00', '2012-09-10 06:00:00',
               '2012-09-10 12:00:00', '2012-09-10 18:00:00',
               '2012-09-11 00:00:00', '2012-09-11 06:00:00',
               '2012-09-11 12:00:00', '2012-09-11 18:00:00',
               '2012-09-12 00:00:00', '2012-09-12 06:00:00',
               '2012-09-12 12:00:00', '2012-09-12 18:00:00',
               '2012-09-13 00:00:00', '2012-09-13 06:00:00',
               '2012-09-13 12:00:00', '2012-09-13 18:00:00',
               '2012-09-14 00:00:00', '2012-09-14 06:00:00',
               '2012-09-14 12:00:00', '2012-09-14 18:00:00',
               '2012-09-15 00:00:00', '2012-09-15 06:00:00',
               '2012-09-15 12:00:00', '2012-09-15 18:00:00',
               '2012-09-16 00:00:00', '2012-09-16 06:00:00',
               '2012-09-16 12:00:00', '2012-09-16 18:00:00',
               '2012-09-17 00:00:00', '2012-09-17 06:00:00',
               '2012-09-17 12:00:00', '2012-09-17 18:00:00',
               '2012-09-18 00:00:00', '2012-09-18 06:00:00',
               '2012-09-18 12:00:00', '2012-09-18 18:00:00',
               '2012-09-19 00:00:00', '2012-09-19 06:00:00',
               '2012-09-19 12:00:00', '2012-09-19 18:00:00',
               '2012-09-20 00:00:00', '2012-09-20 06:00:00',
               '2012-09-20 12:00:00', '2012-09-20 18:00:00',
               '2012-09-21 00:00:00', '2012-09-21 06:00:00'],
              dtype='datetime64[ns]', freq='6H')

## Create Range of Dates with the `pd.date_range()` Method, Part 3

In [28]:
pd.date_range(end = "1999-12-31", periods = 100, freq = "7H")

DatetimeIndex(['1999-12-02 03:00:00', '1999-12-02 10:00:00',
               '1999-12-02 17:00:00', '1999-12-03 00:00:00',
               '1999-12-03 07:00:00', '1999-12-03 14:00:00',
               '1999-12-03 21:00:00', '1999-12-04 04:00:00',
               '1999-12-04 11:00:00', '1999-12-04 18:00:00',
               '1999-12-05 01:00:00', '1999-12-05 08:00:00',
               '1999-12-05 15:00:00', '1999-12-05 22:00:00',
               '1999-12-06 05:00:00', '1999-12-06 12:00:00',
               '1999-12-06 19:00:00', '1999-12-07 02:00:00',
               '1999-12-07 09:00:00', '1999-12-07 16:00:00',
               '1999-12-07 23:00:00', '1999-12-08 06:00:00',
               '1999-12-08 13:00:00', '1999-12-08 20:00:00',
               '1999-12-09 03:00:00', '1999-12-09 10:00:00',
               '1999-12-09 17:00:00', '1999-12-10 00:00:00',
               '1999-12-10 07:00:00', '1999-12-10 14:00:00',
               '1999-12-10 21:00:00', '1999-12-11 04:00:00',
               '1999-12-11 11:00:00', '1999-12-11 18:00:00',
               '1999-12-12 01:00:00', '1999-12-12 08:00:00',
               '1999-12-12 15:00:00', '1999-12-12 22:00:00',
               '1999-12-13 05:00:00', '1999-12-13 12:00:00',
               '1999-12-13 19:00:00', '1999-12-14 02:00:00',
               '1999-12-14 09:00:00', '1999-12-14 16:00:00',
               '1999-12-14 23:00:00', '1999-12-15 06:00:00',
               '1999-12-15 13:00:00', '1999-12-15 20:00:00',
               '1999-12-16 03:00:00', '1999-12-16 10:00:00',
               '1999-12-16 17:00:00', '1999-12-17 00:00:00',
               '1999-12-17 07:00:00', '1999-12-17 14:00:00',
               '1999-12-17 21:00:00', '1999-12-18 04:00:00',
               '1999-12-18 11:00:00', '1999-12-18 18:00:00',
               '1999-12-19 01:00:00', '1999-12-19 08:00:00',
               '1999-12-19 15:00:00', '1999-12-19 22:00:00',
               '1999-12-20 05:00:00', '1999-12-20 12:00:00',
               '1999-12-20 19:00:00', '1999-12-21 02:00:00',
               '1999-12-21 09:00:00', '1999-12-21 16:00:00',
               '1999-12-21 23:00:00', '1999-12-22 06:00:00',
               '1999-12-22 13:00:00', '1999-12-22 20:00:00',
               '1999-12-23 03:00:00', '1999-12-23 10:00:00',
               '1999-12-23 17:00:00', '1999-12-24 00:00:00',
               '1999-12-24 07:00:00', '1999-12-24 14:00:00',
               '1999-12-24 21:00:00', '1999-12-25 04:00:00',
               '1999-12-25 11:00:00', '1999-12-25 18:00:00',
               '1999-12-26 01:00:00', '1999-12-26 08:00:00',
               '1999-12-26 15:00:00', '1999-12-26 22:00:00',
               '1999-12-27 05:00:00', '1999-12-27 12:00:00',
               '1999-12-27 19:00:00', '1999-12-28 02:00:00',
               '1999-12-28 09:00:00', '1999-12-28 16:00:00',
               '1999-12-28 23:00:00', '1999-12-29 06:00:00',
               '1999-12-29 13:00:00', '1999-12-29 20:00:00',
               '1999-12-30 03:00:00', '1999-12-30 10:00:00',
               '1999-12-30 17:00:00', '1999-12-31 00:00:00'],
              dtype='datetime64[ns]', freq='7H')

## The `.dt` Accessor

In [27]:
bunch_of_dates = pd.date_range(start = "2000-01-01", end = "2010-12-31", freq = "24D")

In [28]:
s = pd.Series(bunch_of_dates)
s.head(3)

0   2000-01-01
1   2000-01-25
2   2000-02-18
dtype: datetime64[ns]

In [29]:
mask = s.dt.is_month_end
s[mask]

5     2000-04-30
57    2003-09-30
71    2004-08-31
90    2005-11-30
123   2008-01-31
161   2010-07-31
dtype: datetime64[ns]

## Import Financial Data Set with `pandas_datareader` Library

In [1]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

In [4]:
company = "MSFT"
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(20)

                 High        Low       Open      Close       Volume  Adj Close
Date
2010-01-04  31.100000  30.590000  30.620001  30.950001   38409100.0  23.855654
2010-01-05  31.100000  30.639999  30.850000  30.959999   49749600.0  23.863365
2010-01-06  31.080000  30.520000  30.879999  30.770000   58182400.0  23.716921
2010-01-07  30.700001  30.190001  30.629999  30.450001   50559700.0  23.470264
2010-01-08  30.879999  30.240000  30.280001  30.660000   51197400.0  23.632135
2010-01-11  30.760000  30.120001  30.709999  30.270000   68754700.0  23.331530
2010-01-12  30.400000  29.910000  30.150000  30.070000   65912100.0  23.177376
2010-01-13  30.520000  30.010000  30.260000  30.350000   51863500.0  23.393192
2010-01-14  31.100000  30.260000  30.309999  30.959999   63228100.0  23.863365
2010-01-15  31.240000  30.709999  31.080000  30.860001   79913200.0  23.786285
2010-01-19  31.240000  30.680000  30.750000  31.100000   46575700.0  23.971277
2010-01-20  30.940001  30.309999  30.809999  30.590000   54849500.0  23.578173
2010-01-21  30.719999  30.000000  30.610001  30.010000   73086700.0  23.131124
2010-01-22  30.200001  28.840000  30.000000  28.959999  102004600.0  22.321802
2010-01-25  29.660000  29.100000  29.240000  29.320000   63373000.0  22.599283
2010-01-26  29.850000  29.090000  29.200001  29.500000   66639900.0  22.738022
2010-01-27  29.820000  29.020000  29.350000  29.670000   63949500.0  22.869053
2010-01-28  29.870001  28.889999  29.840000  29.160000  117513700.0  22.475964
2010-01-29  29.920000  27.660000  29.900000  28.180000  193888500.0  21.720594
2010-02-01  28.480000  27.920000  28.389999  28.410000   85931100.0  21.897877

In [8]:
stocks.values
stocks.columns
stocks.index[0]
stocks.axes

[DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
                '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
                '2010-01-14', '2010-01-15',
                ...
                '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
                '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
                '2017-12-28', '2017-12-29'],
               dtype='datetime64[ns]', name='Date', length=2013, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

## Selecting from a `DataFrame` with a `DateTimeIndex`

In [9]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  23.855663
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  23.863367
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  23.716915

In [12]:
stocks.loc["2014-03-04"]
stocks.loc[pd.Timestamp("2014-03-04")]
stocks.iloc[300]

High         2.576000e+01
Low          2.535000e+01
Open         2.549000e+01
Close        2.569000e+01
Volume       5.447340e+07
Adj Close    2.033323e+01
Name: 2011-03-14 00:00:00, dtype: float64

In [15]:
stocks.loc["2013-10-01" : "2013-10-07"]
stocks.truncate(before= "2013-10-01", after= "2013-10-07")

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  28.518589
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  28.807331
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  28.756374
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  28.773359
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.280787

In [16]:
birthdays = pd.date_range(start = "1992-08-09", end = "2022-12-31", freq = pd.DateOffset(years = 1))

In [17]:
mask = stocks.index.isin(birthdays)

In [18]:
stocks[mask]

                 High        Low       Open      Close       Volume  Adj Close
Date
2010-08-09  25.730000  25.370001  25.549999  25.610001   57096500.0  19.921488
2011-08-09  25.620001  24.030001  24.709999  25.580000  126268900.0  20.378880
2012-08-09  30.650000  30.299999  30.389999  30.500000   24920800.0  24.960899
2013-08-09  32.900002  32.470001  32.770000  32.700001   26800700.0  27.576900
2016-08-09  58.500000  58.020000  58.169998  58.200001   16920700.0  53.306828
2017-08-09  72.510002  72.050003  72.250000  72.470001   22213400.0  68.037407

## `Timestamp` Object Attributes

In [19]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  23.855652
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  23.863367
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  23.716915

In [20]:
someday = stocks.index[500]
someday

Timestamp('2011-12-27 00:00:00')

In [22]:
someday.day
someday.month
someday.year
someday.is_month_end
someday.is_month_start

False

In [23]:
stocks.index.day_name()

Index(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Monday',
       'Tuesday', 'Wednesday', 'Thursday', 'Friday',
       ...
       'Friday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday',
       'Tuesday', 'Wednesday', 'Thursday', 'Friday'],
      dtype='object', name='Date', length=2013)

In [24]:
stocks.insert(0, "Day of Week",stocks.index.day_name() )

In [26]:
stocks.insert(1, "Is Start of Month", stocks.index.is_month_start)

In [27]:
stocks[stocks["Is Start of Month"]]

,Day of Week,Is Start of Month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-02-01,Monday,True,28.480000,27.920000,28.389999,28.410000,85931100.0,21.897869
2010-03-01,Monday,True,29.049999,28.530001,28.770000,29.020000,43805400.0,22.472645
2010-04-01,Thursday,True,29.540001,28.620001,29.350000,29.160000,74768100.0,22.581060
2010-06-01,Tuesday,True,26.309999,25.520000,25.530001,25.889999,76152400.0,20.139294
2010-07-01,Thursday,True,23.320000,22.730000,23.090000,23.160000,92239400.0,18.015682
...,...,...,...,...,...,...,...,...
2017-06-01,Thursday,True,70.610001,69.449997,70.239998,70.099998,21603600.0,65.812347
2017-08-01,Tuesday,True,73.419998,72.489998,73.099998,72.580002,22132300.0,68.140686
2017-09-01,Friday,True,74.739998,73.639999,74.709999,73.940002,21736200.0,69.787331
2017-11-01,Wednesday,True,83.760002,82.879997,83.680000,83.180000,22307400.0,78.508400
2017-12-01,Friday,True,84.809998,83.220001,83.599998,84.260002,29532100.0,79.927147

## The `.truncate()` Method

In [89]:
stocks = data.DataReader(name = company, data_source = "google", start = start, end = end)
stocks.head(3)

             Open   High    Low  Close    Volume
Date
2010-01-04  30.62  31.10  30.59  30.95  38414185
2010-01-05  30.85  31.10  30.64  30.96  49758862
2010-01-06  30.88  31.08  30.52  30.77  58182332

In [92]:
stocks.truncate(before = "2012-06-07", after = "2013-02-28")

             Open   High    Low  Close     Volume
Date
2012-06-07  29.64  29.70  29.17  29.23   37794901
2012-06-08  29.21  29.68  29.05  29.65   42554321
2012-06-11  29.73  29.81  28.82  28.90   46365066
2012-06-12  29.10  29.30  28.84  29.29   35338135
2012-06-13  29.22  29.44  29.05  29.13   32984515
2012-06-14  29.33  29.46  28.88  29.34   39460156
2012-06-15  29.59  30.08  29.49  30.02   62314362
2012-06-18  29.99  30.03  29.71  29.84   58679618
2012-06-19  30.19  31.11  30.05  30.70   75725717
2012-06-20  30.93  31.05  30.64  30.93   36257101
2012-06-21  30.96  31.14  30.06  30.14   48461283
2012-06-22  30.30  30.73  30.03  30.70   45098017
2012-06-25  30.30  30.32  29.62  29.86   42225199
2012-06-26  30.00  30.27  29.94  30.02   38422237
2012-06-27  30.19  30.50  30.03  30.17   33783977
2012-06-28  29.98  30.05  29.42  29.91   45333920
2012-06-29  30.45  30.69  30.14  30.59   55227108
2012-07-02  30.62  30.62  30.21  30.56   30589039
2012-07-03  30.23  30.76  30.17  30.76   20941442
2012-07-05  30.59  30.78  30.38  30.70   28802821
2012-07-06  30.61  30.70  29.95  30.18   38297403
2012-07-09  30.12  30.23  29.78  30.00   30682552
2012-07-10  30.08  30.22  29.51  29.74   37537369
2012-07-11  29.71  29.74  29.10  29.30   39188842
2012-07-12  29.15  29.18  28.54  28.63   63530444
2012-07-13  28.76  29.48  28.72  29.39   39090585
2012-07-16  29.48  29.53  29.04  29.44   27901963
2012-07-17  29.64  29.86  29.20  29.66   33776331
2012-07-18  29.60  30.45  29.46  30.45   41100151
2012-07-19  30.51  30.80  30.38  30.66   46663183
...           ...    ...    ...    ...        ...
2013-01-16  27.15  27.23  27.01  27.04   41077374
2013-01-17  27.19  27.47  27.06  27.25   51685841
2013-01-18  27.10  27.29  27.04  27.25   52171305
2013-01-22  27.30  27.45  27.00  27.15   58656745
2013-01-23  27.20  27.64  27.20  27.61   50387614
2013-01-24  27.70  28.07  27.47  27.63  101739246
2013-01-25  27.58  28.23  27.39  27.88   81853106
2013-01-28  28.01  28.22  27.76  27.91   56061493
2013-01-29  27.82  28.13  27.60  28.01   49247863
2013-01-30  28.01  28.19  27.76  27.85   43585526
2013-01-31  27.79  27.97  27.40  27.45   50536148
2013-02-01  27.67  28.05  27.55  27.93   55566440
2013-02-04  27.87  28.02  27.42  27.44   50539942
2013-02-05  27.62  27.66  27.36  27.50   35410361
2013-02-06  27.38  27.54  27.25  27.34   41889572
2013-02-07  27.35  27.39  27.10  27.28   38034068
2013-02-08  27.35  27.71  27.31  27.55   33320436
2013-02-11  27.65  27.92  27.50  27.86   32248149
2013-02-12  27.88  28.00  27.75  27.88   35991329
2013-02-13  27.93  28.11  27.88  28.03   41716060
2013-02-14  27.92  28.06  27.87  28.04   32663454
2013-02-15  28.04  28.16  27.88  28.01   49657740
2013-02-19  27.88  28.09  27.80  28.04   38806870
2013-02-20  28.13  28.20  27.83  27.87   44112446
2013-02-21  27.74  27.74  27.23  27.49   49085538
2013-02-22  27.68  27.76  27.48  27.76   31430018
2013-02-25  27.97  28.05  27.37  27.37   48020353
2013-02-26  27.38  27.60  27.34  27.37   49925050
2013-02-27  27.42  28.00  27.33  27.81   36395589
2013-02-28  27.88  27.97  27.74  27.80   35840861

[182 rows x 5 columns]

## `pd.DateOffset` Objects

In [28]:
stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())
stocks.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813290  49.982655  44871361.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942874.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342897.0  54.495735

In [30]:
stocks.index + pd.DateOffset( days = 2)

DatetimeIndex(['2004-08-21', '2004-08-22', '2004-08-25', '2004-08-26',
               '2004-08-27', '2004-08-28', '2004-08-29', '2004-09-01',
               '2004-09-02', '2004-09-03',
               ...
               '2022-04-13', '2022-04-14', '2022-04-15', '2022-04-16',
               '2022-04-20', '2022-04-21', '2022-04-22', '2022-04-23',
               '2022-04-24', '2022-04-27'],
              dtype='datetime64[ns]', name='Date', length=4452, freq=None)

In [31]:
stocks.index - pd.DateOffset( days = 2)

DatetimeIndex(['2004-08-17', '2004-08-18', '2004-08-21', '2004-08-22',
               '2004-08-23', '2004-08-24', '2004-08-25', '2004-08-28',
               '2004-08-29', '2004-08-30',
               ...
               '2022-04-09', '2022-04-10', '2022-04-11', '2022-04-12',
               '2022-04-16', '2022-04-17', '2022-04-18', '2022-04-19',
               '2022-04-20', '2022-04-23'],
              dtype='datetime64[ns]', name='Date', length=4452, freq=None)

In [32]:
stocks.index + pd.DateOffset(months = 8, years = 5, days = 12, hours = 3, minutes = 42)

DatetimeIndex(['2010-05-01 03:42:00', '2010-05-02 03:42:00',
               '2010-05-05 03:42:00', '2010-05-06 03:42:00',
               '2010-05-07 03:42:00', '2010-05-08 03:42:00',
               '2010-05-09 03:42:00', '2010-05-12 03:42:00',
               '2010-05-12 03:42:00', '2010-05-13 03:42:00',
               ...
               '2027-12-23 03:42:00', '2027-12-24 03:42:00',
               '2027-12-25 03:42:00', '2027-12-26 03:42:00',
               '2027-12-30 03:42:00', '2027-12-31 03:42:00',
               '2028-01-01 03:42:00', '2028-01-02 03:42:00',
               '2028-01-03 03:42:00', '2028-01-06 03:42:00'],
              dtype='datetime64[ns]', name='Date', length=4452, freq=None)

## More Fun with `pd.DateOffset` Objects

In [33]:
import pandas as pd
import datetime as dt
from pandas_datareader import data
from pandas.tseries.offsets import *

In [34]:
stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())

stocks.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813290  49.982655  44871361.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942874.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342897.0  54.495735

In [35]:
stocks.index - MonthEnd()
stocks.index - BMonthEnd()
stocks.index - QuarterEnd()
stocks.index - QuarterBegin()

DatetimeIndex(['2004-06-01', '2004-06-01', '2004-06-01', '2004-06-01',
               '2004-06-01', '2004-06-01', '2004-06-01', '2004-06-01',
               '2004-06-01', '2004-06-01',
               ...
               '2022-03-01', '2022-03-01', '2022-03-01', '2022-03-01',
               '2022-03-01', '2022-03-01', '2022-03-01', '2022-03-01',
               '2022-03-01', '2022-03-01'],
              dtype='datetime64[ns]', name='Date', length=4452, freq=None)

In [36]:
stocks.index - YearBegin()

DatetimeIndex(['2004-01-01', '2004-01-01', '2004-01-01', '2004-01-01',
               '2004-01-01', '2004-01-01', '2004-01-01', '2004-01-01',
               '2004-01-01', '2004-01-01',
               ...
               '2022-01-01', '2022-01-01', '2022-01-01', '2022-01-01',
               '2022-01-01', '2022-01-01', '2022-01-01', '2022-01-01',
               '2022-01-01', '2022-01-01'],
              dtype='datetime64[ns]', name='Date', length=4452, freq=None)

## The `Timedelta` Object

In [37]:
timeA = pd.Timestamp("2016-03-31 04:35:16 PM")
timeB = pd.Timestamp("2016-03-20 02:16:49 AM")

In [38]:
timeB - timeA

Timedelta('-12 days +09:41:33')

In [39]:
type(timeA - timeB)

pandas._libs.tslibs.timedeltas.Timedelta

In [40]:
type(timeA)

pandas._libs.tslibs.timestamps.Timestamp

In [41]:
pd.Timedelta(weeks = 8, days = 3, hours = 12, minutes = 45)

Timedelta('59 days 12:45:00')

In [42]:
pd.Timedelta("14 days 6 hours 12 minutes 49 seconds")

Timedelta('14 days 06:12:49')

## `Timedeltas` in a Dataset

In [43]:
shipping = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\ecommerce.csv", index_col = "ID", parse_dates = ["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [44]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]

In [45]:
shipping.head(3)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [46]:
shipping["Twice As Long"] = shipping["delivery_date"] + shipping["Delivery Time"]

In [47]:
shipping.head(3)

   order_date delivery_date Delivery Time Twice As Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [48]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice As Long     datetime64[ns]
dtype: object

In [52]:
mask1  = shipping["Delivery Time"] > "365 days"
shipping[mask1]

    order_date delivery_date Delivery Time Twice As Long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
..         ...           ...           ...           ...
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]

In [49]:
mask = shipping["Delivery Time"] == "3423 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
130 1990-04-02    1999-08-16     3423 days    2008-12-29

In [50]:
shipping["Delivery Time"].min()

Timedelta('8 days 00:00:00')